; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph6 - mode
	thermograph1 - mode
	spectrograph7 - mode
	infrared0 - mode
	infrared3 - mode
	spectrograph5 - mode
	image4 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star6 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image4)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph6)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph5)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Planet7 spectrograph5)
	(have_image Planet8 image4)
	(have_image Star9 spectrograph6)
	(have_image Star9 infrared2)
	(have_image Phenomenon10 image4)
	(have_image Phenomenon10 spectrograph6)
	(have_image Planet11 spectrograph7)
	(have_image Planet11 thermograph1)
	(have_image Planet12 infrared2)
	(have_image Star13 spectrograph7)
	(have_image Star13 infrared3)
	(have_image Star14 infrared0)
	(have_image Star14 image4)
))

)

; plan
1. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star14)
   goals met: 1 of 14
5. (take_image satellite0 star14 instrument0 image4)
   added: (have_image star14 image4)
   goals met: 2 of 14
6. (turn_to satellite0 star13 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star13)
   goals met: 1 of 14
7. (take_image satellite0 star13 instrument0 spectrograph7)
   added: (have_image star13 spectrograph7)
   goals met: 2 of 14
8. (take_image satellite0 star13 instrument0 infrared3)
   added: (have_image star13 infrared3)
   goals met: 3 of 14
9. (turn_to satellite0 planet8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet8)
   goals met: 3 of 14
10. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 4 of 14
11. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   goals met: 4 of 14
12. (take_image satellite0 planet11 instrument0 spectrograph7)
   added: (have_image planet11 spectrograph7)
   goals met: 5 of 14
13. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 14
14. (take_image satellite0 phenomenon10 instrument0 image4)
   added: (have_image phenomenon10 image4)
   goals met: 6 of 14
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 14
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 14
17. (turn_to satellite0 star1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star1)
   goals met: 6 of 14
18. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 6 of 14
19. (turn_to satellite0 planet11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet11)
   goals met: 6 of 14
20. (take_image satellite0 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 7 of 14
21. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 14
22. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 14
23. (turn_to satellite0 star4 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star4)
   goals met: 7 of 14
24. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 7 of 14
25. (turn_to satellite0 phenomenon10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon10)
   goals met: 7 of 14
26. (take_image satellite0 phenomenon10 instrument2 spectrograph6)
   added: (have_image phenomenon10 spectrograph6)
   goals met: 8 of 14
27. (turn_to satellite0 planet12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet12)
   goals met: 8 of 14
28. (take_image satellite0 planet12 instrument2 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 9 of 14
29. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   goals met: 9 of 14
30. (take_image satellite0 planet7 instrument2 spectrograph5)
   added: (have_image planet7 spectrograph5)
   goals met: 10 of 14
31. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 10 of 14
32. (take_image satellite0 star9 instrument2 infrared2)
   added: (have_image star9 infrared2)
   goals met: 11 of 14
33. (take_image satellite0 star9 instrument2 spectrograph6)
   added: (have_image star9 spectrograph6)
   goals met: 12 of 14
34. (turn_to satellite0 star14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star14)
   goals met: 13 of 14
35. (take_image satellite0 star14 instrument2 infrared0)
   added: (have_image star14 infrared0)
   goals met: 14 of 14
